# .zsh_plugins.txt

## theme
romkatv/powerlevel10k


# oh my zsh
ohmyzsh/ohmyzsh path:lib kind:fpath

ohmyzsh/ohmyzsh path:plugins/git kind:fpath
ohmyzsh/ohmyzsh path:plugins/pip kind:fpath
ohmyzsh/ohmyzsh path:plugins/aws kind:fpath
ohmyzsh/ohmyzsh path:plugins/extract kind:fpath

# zsh-users
zsh-users/zsh-completions
zsh-users/zsh-autosuggestions
zsh-users/zsh-syntax-highlighting

# misc
nobeans/zsh-sdkman

# now, use a plugin that runs compinit for you to initialize your completions
mattmc3/zephyr path:completion

