# .zsh_plugins.txt

## theme
romkatv/powerlevel10k

# oh my zsh
ohmyzsh/ohmyzsh path:lib

ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/pip
ohmyzsh/ohmyzsh path:plugins/aws
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/docker-compose
ohmyzsh/ohmyzsh path:plugins/archlinux
ohmyzsh/ohmyzsh path:plugins/ubuntu

# zsh-users
zsh-users/zsh-completions kind:fpath
zsh-users/zsh-autosuggestions
zsh-users/zsh-syntax-highlighting

# misc
nobeans/zsh-sdkman kind:fpath
djui/alias-tips
sawadashota/go-task-completions kind:fpath
ohmyzsh/ohmyzsh path:plugins/kubectl
ohmyzsh/ohmyzsh path:plugins/brew

# now, use a plugin that runs compinit for you to initialize your completions
mattmc3/zephyr path:plugins/completion
